spec/cassettes/StripeWrapper/StripeWrapper_Charge/_create/makes_a_card_declined_charge.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4000000000000002&card[exp_month]=10&card[exp_year]=2018&card[cvc]=314
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.8
      Authorization:
      - Bearer sk_test_NIBfnP5xbcxM83SIoGM6IdiE
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.8.8","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin13.0.0","publisher":"stripe","uname":"Darwin
        Yemaya.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19 22:22:27 PDT
        2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '82'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 06 Nov 2013 17:46:57 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '571'
      Connection:
      - keep-alive
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Credentials:
      - 'true'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_102tN82g7UGZZ3q1WjwPXWlV",
          "livemode": false,
          "created": 1383760017,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_102tN82g7UGZZ3q1uAitqSdI",
            "object": "card",
            "last4": "0002",
            "type": "Visa",
            "exp_month": 10,
            "exp_year": 2018,
            "fingerprint": "syMFHDw5cBzYpTNi",
            "customer": null,
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null
          }
        }
    http_version: 
  recorded_at: Wed, 06 Nov 2013 17:46:57 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=999&currency=usd&card=tok_102tN82g7UGZZ3q1WjwPXWlV&description=An%20invalid%20test%20charge
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.8
      Authorization:
      - Bearer sk_test_NIBfnP5xbcxM83SIoGM6IdiE
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.8.8","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin13.0.0","publisher":"stripe","uname":"Darwin
        Yemaya.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19 22:22:27 PDT
        2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '98'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Wed, 06 Nov 2013 17:46:57 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '162'
      Connection:
      - keep-alive
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Credentials:
      - 'true'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your card was declined.",
            "type": "card_error",
            "code": "card_declined",
            "charge": "ch_102tN82g7UGZZ3q1hhDxYWvI"
          }
        }
    http_version: 
  recorded_at: Wed, 06 Nov 2013 17:46:57 GMT
recorded_with: VCR 2.7.0
