spec/cassettes/StripeWrapper/StripeWrapper_Customer/_create/returns_the_customer_token_for_a_valid_card.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=10&card[exp_year]=2018&card[cvc]=314
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.8
      Authorization:
      - Bearer sk_test_NIBfnP5xbcxM83SIoGM6IdiE
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.8.8","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin13.0.0","publisher":"stripe","uname":"Darwin
        yemaya 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19 22:22:27 PDT 2013;
        root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '82'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 15 Dec 2013 04:32:53 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '571'
      Connection:
      - keep-alive
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_1037m82g7UGZZ3q1tKc7VNzZ",
          "livemode": false,
          "created": 1387081973,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_1037m82g7UGZZ3q1gkCsSu1o",
            "object": "card",
            "last4": "4242",
            "type": "Visa",
            "exp_month": 10,
            "exp_year": 2018,
            "fingerprint": "xoIy03alAaIPDOdC",
            "customer": null,
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null
          }
        }
    http_version: 
  recorded_at: Sun, 15 Dec 2013 04:32:53 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card=tok_1037m82g7UGZZ3q1tKc7VNzZ&plan=base&email=isabelle%40gusikowski.info
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.8
      Authorization:
      - Bearer sk_test_NIBfnP5xbcxM83SIoGM6IdiE
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.8.8","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin13.0.0","publisher":"stripe","uname":"Darwin
        yemaya 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19 22:22:27 PDT 2013;
        root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '76'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 15 Dec 2013 04:32:55 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1744'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1387081974,
          "id": "cus_37m8jMhc6l3KV8",
          "livemode": false,
          "description": null,
          "email": "isabelle@gusikowski.info",
          "delinquent": false,
          "metadata": {},
          "subscription": {
            "id": "sub_37m8AShxBlyLHl",
            "plan": {
              "interval": "month",
              "name": "Base Plan",
              "amount": 999,
              "currency": "usd",
              "id": "base",
              "object": "plan",
              "livemode": false,
              "interval_count": 1,
              "trial_period_days": null,
              "metadata": {}
            },
            "object": "subscription",
            "start": 1387081974,
            "status": "active",
            "customer": "cus_37m8jMhc6l3KV8",
            "cancel_at_period_end": false,
            "current_period_start": 1387081974,
            "current_period_end": 1389760374,
            "ended_at": null,
            "trial_start": null,
            "trial_end": null,
            "canceled_at": null,
            "quantity": 1,
            "application_fee_percent": null
          },
          "discount": null,
          "account_balance": 0,
          "cards": {
            "object": "list",
            "count": 1,
            "url": "/v1/customers/cus_37m8jMhc6l3KV8/cards",
            "data": [
              {
                "id": "card_1037m82g7UGZZ3q1gkCsSu1o",
                "object": "card",
                "last4": "4242",
                "type": "Visa",
                "exp_month": 10,
                "exp_year": 2018,
                "fingerprint": "xoIy03alAaIPDOdC",
                "customer": "cus_37m8jMhc6l3KV8",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null
              }
            ]
          },
          "default_card": "card_1037m82g7UGZZ3q1gkCsSu1o"
        }
    http_version: 
  recorded_at: Sun, 15 Dec 2013 04:32:55 GMT
recorded_with: VCR 2.7.0
